docs/benchmark/results-wrk2-c1000/raw/gateway-R50000-r1.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.732ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.744ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.752ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.726ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms    1.12ms  18.98ms   74.70%
    Req/Sec    13.18k     2.24k   27.00k    74.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.61ms
 75.000%    2.33ms
 90.000%    3.09ms
 99.000%    4.66ms
 99.900%   12.49ms
 99.990%   15.94ms
 99.999%   18.66ms
100.000%   18.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            1         1.00
       0.581     0.100000        18795         1.11
       0.866     0.200000        37514         1.25
       1.109     0.300000        56252         1.43
       1.354     0.400000        75021         1.67
       1.612     0.500000        93790         2.00
       1.740     0.550000       103167         2.22
       1.871     0.600000       112553         2.50
       2.009     0.650000       121923         2.86
       2.157     0.700000       131254         3.33
       2.329     0.750000       140712         4.00
       2.425     0.775000       145343         4.44
       2.535     0.800000       150049         5.00
       2.653     0.825000       154736         5.71
       2.783     0.850000       159388         6.67
       2.925     0.875000       164091         8.00
       3.003     0.887500       166447         8.89
       3.085     0.900000       168755        10.00
       3.173     0.912500       171091        11.43
       3.269     0.925000       173437        13.33
       3.381     0.937500       175797        16.00
       3.443     0.943750       176987        17.78
       3.511     0.950000       178159        20.00
       3.585     0.956250       179297        22.86
       3.671     0.962500       180485        26.67
       3.773     0.968750       181640        32.00
       3.837     0.971875       182237        35.56
       3.905     0.975000       182811        40.00
       3.993     0.978125       183397        45.71
       4.099     0.981250       183981        53.33
       4.223     0.984375       184564        64.00
       4.307     0.985938       184864        71.11
       4.415     0.987500       185157        80.00
       4.551     0.989062       185451        91.43
       4.723     0.990625       185743       106.67
       4.967     0.992188       186034       128.00
       5.095     0.992969       186177       142.22
       5.295     0.993750       186322       160.00
       5.843     0.994531       186468       182.86
       6.543     0.995313       186617       213.33
       7.071     0.996094       186762       256.00
       7.435     0.996484       186834       284.44
       8.083     0.996875       186908       320.00
       8.551     0.997266       186982       365.71
       9.079     0.997656       187055       426.67
      10.231     0.998047       187127       512.00
      10.815     0.998242       187164       568.89
      11.335     0.998437       187201       640.00
      11.679     0.998633       187238       731.43
      12.167     0.998828       187274       853.33
      12.527     0.999023       187310      1024.00
      12.687     0.999121       187329      1137.78
      12.871     0.999219       187348      1280.00
      13.135     0.999316       187366      1462.86
      13.415     0.999414       187384      1706.67
      13.711     0.999512       187403      2048.00
      13.887     0.999561       187412      2275.56
      14.039     0.999609       187421      2560.00
      14.175     0.999658       187429      2925.71
      14.503     0.999707       187439      3413.33
      15.151     0.999756       187448      4096.00
      15.367     0.999780       187452      4551.11
      15.479     0.999805       187457      5120.00
      15.559     0.999829       187461      5851.43
      15.623     0.999854       187466      6826.67
      15.847     0.999878       187471      8192.00
      15.927     0.999890       187473      9102.22
      15.999     0.999902       187476     10240.00
      16.031     0.999915       187477     11702.86
      16.199     0.999927       187480     13653.33
      16.343     0.999939       187482     16384.00
      16.359     0.999945       187483     18204.44
      16.447     0.999951       187484     20480.00
      16.735     0.999957       187485     23405.71
      17.999     0.999963       187487     27306.67
      18.047     0.999969       187488     32768.00
      18.047     0.999973       187488     36408.89
      18.175     0.999976       187489     40960.00
      18.175     0.999979       187489     46811.43
      18.303     0.999982       187490     54613.33
      18.655     0.999985       187491     65536.00
      18.655     0.999986       187491     72817.78
      18.655     0.999988       187491     81920.00
      18.655     0.999989       187491     93622.86
      18.927     0.999991       187492    109226.67
      18.927     0.999992       187492    131072.00
      18.927     0.999993       187492    145635.56
      18.927     0.999994       187492    163840.00
      18.927     0.999995       187492    187245.71
      18.991     0.999995       187493    218453.33
      18.991     1.000000       187493          inf
#[Mean    =        1.764, StdDeviation   =        1.119]
#[Max     =       18.976, Total count    =       187493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  719274 requests in 15.00s, 459.59MB read
Requests/sec:  47946.12
Transfer/sec:     30.64MB