docs/benchmark/results-wrk2-c1000/raw/gateway-R50000-r2.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.728ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.715ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.717ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.683ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    1.13ms  18.86ms   73.30%
    Req/Sec    13.19k     2.23k   21.22k    72.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.62ms
 75.000%    2.39ms
 90.000%    3.16ms
 99.000%    4.55ms
 99.900%   12.41ms
 99.990%   14.82ms
 99.999%   17.25ms
100.000%   18.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.076     0.000000            1         1.00
       0.572     0.100000        18823         1.11
       0.845     0.200000        37508         1.25
       1.086     0.300000        56262         1.43
       1.342     0.400000        74996         1.67
       1.620     0.500000        93774         2.00
       1.762     0.550000       103156         2.22
       1.903     0.600000       112488         2.50
       2.046     0.650000       121890         2.86
       2.209     0.700000       131315         3.33
       2.393     0.750000       140609         4.00
       2.499     0.775000       145306         4.44
       2.613     0.800000       150045         5.00
       2.737     0.825000       154703         5.71
       2.865     0.850000       159391         6.67
       3.005     0.875000       164054         8.00
       3.079     0.887500       166410         8.89
       3.159     0.900000       168734        10.00
       3.243     0.912500       171095        11.43
       3.339     0.925000       173450        13.33
       3.445     0.937500       175794        16.00
       3.505     0.943750       176942        17.78
       3.571     0.950000       178103        20.00
       3.643     0.956250       179289        22.86
       3.729     0.962500       180445        26.67
       3.829     0.968750       181631        32.00
       3.881     0.971875       182206        35.56
       3.947     0.975000       182790        40.00
       4.019     0.978125       183377        45.71
       4.103     0.981250       183962        53.33
       4.215     0.984375       184550        64.00
       4.283     0.985938       184841        71.11
       4.359     0.987500       185137        80.00
       4.471     0.989062       185424        91.43
       4.603     0.990625       185719       106.67
       4.787     0.992188       186013       128.00
       4.903     0.992969       186156       142.22
       5.055     0.993750       186303       160.00
       5.371     0.994531       186452       182.86
       6.207     0.995313       186596       213.33
       6.899     0.996094       186743       256.00
       7.343     0.996484       186815       284.44
       8.011     0.996875       186889       320.00
       8.759     0.997266       186962       365.71
       9.199     0.997656       187036       426.67
       9.823     0.998047       187109       512.00
      10.415     0.998242       187145       568.89
      11.215     0.998437       187182       640.00
      11.855     0.998633       187218       731.43
      12.199     0.998828       187256       853.33
      12.463     0.999023       187292      1024.00
      12.807     0.999121       187310      1137.78
      13.031     0.999219       187329      1280.00
      13.287     0.999316       187346      1462.86
      13.543     0.999414       187365      1706.67
      13.695     0.999512       187383      2048.00
      13.807     0.999561       187392      2275.56
      13.999     0.999609       187401      2560.00
      14.103     0.999658       187410      2925.71
      14.199     0.999707       187420      3413.33
      14.271     0.999756       187429      4096.00
      14.311     0.999780       187434      4551.11
      14.375     0.999805       187439      5120.00
      14.455     0.999829       187442      5851.43
      14.535     0.999854       187447      6826.67
      14.639     0.999878       187452      8192.00
      14.775     0.999890       187454      9102.22
      14.943     0.999902       187456     10240.00
      15.143     0.999915       187458     11702.86
      15.535     0.999927       187461     13653.33
      16.247     0.999939       187463     16384.00
      16.287     0.999945       187464     18204.44
      16.399     0.999951       187465     20480.00
      16.895     0.999957       187466     23405.71
      17.055     0.999963       187468     27306.67
      17.071     0.999969       187469     32768.00
      17.071     0.999973       187469     36408.89
      17.183     0.999976       187470     40960.00
      17.183     0.999979       187470     46811.43
      17.231     0.999982       187471     54613.33
      17.247     0.999985       187472     65536.00
      17.247     0.999986       187472     72817.78
      17.247     0.999988       187472     81920.00
      17.247     0.999989       187472     93622.86
      18.367     0.999991       187473    109226.67
      18.367     0.999992       187473    131072.00
      18.367     0.999993       187473    145635.56
      18.367     0.999994       187473    163840.00
      18.367     0.999995       187473    187245.71
      18.879     0.999995       187474    218453.33
      18.879     1.000000       187474          inf
#[Mean    =        1.781, StdDeviation   =        1.133]
#[Max     =       18.864, Total count    =       187474]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  719230 requests in 15.00s, 459.56MB read
Requests/sec:  47950.64
Transfer/sec:     30.64MB